Тестовая_база_ERP_14/src/Documents/ТелефонныйЗвонок/ТелефонныйЗвонок.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ТелефонныйЗвонок</name>
  <basedOn>Document.Встреча</basedOn>
  <basedOn>Document.ТелефонныйЗвонок</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоВходящее</basedOn>
  <basedOn>Document.ЭлектронноеПисьмоИсходящее</basedOn>
  <basedOn>Document.ЗапланированноеВзаимодействие</basedOn>
  <basedOn>Document.СообщениеSMS</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>АбонентКакСвязаться</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АбонентКонтакт</name>
    <type>
      <types>DefinedType.сфпКонтактВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>АбонентПредставление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВариантыВажностиВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>Входящий</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_Рассмотрено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалить_РассмотретьПосле</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьПредмет</name>
    <type>
      <types>DefinedType.ПредметВзаимодействия</types>
    </type>
  </attributes>
  <attributes>
    <name>ВзаимодействиеОснование</name>
    <type>
      <types>DocumentRef.CRM_Интерес</types>
      <types>DocumentRef.ЭлектронноеПисьмоИсходящее</types>
      <types>DocumentRef.ЗапланированноеВзаимодействие</types>
      <types>DocumentRef.ЭлектронноеПисьмоВходящее</types>
      <types>DocumentRef.ТелефонныйЗвонок</types>
      <types>DocumentRef.CRM_Телемаркетинг</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.удалитьCRM_Мероприятие</types>
      <types>DocumentRef.Встреча</types>
      <types>BusinessProcessRef.CRM_БизнесПроцесс</types>
      <types>DocumentRef.УдалитьCRM_Сделка</types>
      <types>DocumentRef.СообщениеSMS</types>
      <types>DocumentRef.УдалитьCRM_Событие</types>
    </type>
  </attributes>
  <attributes>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1024</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_СкрытьВАРМ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпCoMagicID</name>
    <comment>Идентификатор контакта в системе CoMagic</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпДлительностьЗвонка</name>
    <comment>Длительность звонка в секундах</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпИдентификаторЗаписи</name>
    <comment>Идентификатор записи</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпИдентификаторЗвонка</name>
    <comment>Идентификатор звонка</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>сфпСостояниеЗвонка</name>
    <comment>Состояние звонка</comment>
    <type>
      <types>EnumRef.сфпСостоянияЗвонков</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_РольОтветственного</name>
    <type>
      <types>CatalogRef.РолиИсполнителей</types>
    </type>
  </attributes>
  <attributes>
    <name>сфпПерезвонили</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>DefinedType.ЗначениеДоступа</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Тестовая_база_ERP_14/src/Documents/ТелефонныйЗвонок/Forms/сфпФормаДокументаКраткая/Module.bsl
#Область ОписаниеПеременных
#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("НовыйЗвонок") Тогда	
		Звонок = Параметры.НовыйЗвонок;
	КонецЕсли;
	
	Если Параметры.Свойство("Контакт") Тогда
		Контакт = Параметры.Контакт;
	КонецЕсли;
	
	ПредставлениеКонтакта = Звонок.АбонентПредставление;

	Элементы.ПредставлениеКонтакта.ТолькоПросмотр = ЗначениеЗаполнено(Контакт);
	
	Если Параметры.Свойство("НомерТелефона") Тогда
		НомерТелефона = Параметры.НомерТелефона;
	КонецЕсли;

	ЭтаФорма.Заголовок = Звонок;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		Если Модифицированность Тогда
			ЗаписатьИзменения();
		КонецЕсли;	
	КонецЕсли;
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОткрытьТелефонныйЗвонок(Команда)
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		Если Модифицированность Тогда
			ЗаписатьИзменения();
		КонецЕсли;	
		
		ПараметрыФормы = Новый Структура("Ключ", Звонок);
		ОткрытьФорму("Документ.ТелефонныйЗвонок.Форма.сфпФормаДокумента", ПараметрыФормы,,,,,, РежимОткрытияОкнаФормы.Независимый);
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаписатьИзменения()
	
	Если ЗначениеЗаполнено(Звонок) Тогда
		ТекОбъект = Звонок.ПолучитьОбъект();
		
		ЗаписатьОбъект = Ложь;
		
		Если НЕ Элементы.ПредставлениеКонтакта.ТолькоПросмотр И ЗначениеЗаполнено(ПредставлениеКонтакта) Тогда
			Если ТекОбъект.АбонентПредставление <> ПредставлениеКонтакта Тогда
				ТекОбъект.АбонентПредставление = ПредставлениеКонтакта;
				ЗаписатьОбъект = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Комментарий) Тогда
			Если ТекОбъект.Комментарий <> Комментарий Тогда
				ТекОбъект.Комментарий = Комментарий;
				ЗаписатьОбъект = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗаписатьОбъект Тогда
			ТекОбъект.Записать();
		КонецЕсли;
	КонецЕсли;

	Модифицированность = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПредставлениеКонтактаПриИзменении(Элемент)
	Модифицированность = Истина;
КонецПроцедуры

#КонецОбласти

#Область Инициализация
#КонецОбласти
